<?xml version="1.0" encoding="UTF-8"?>
<refentry xmlns:xlink="http://www.w3.org/1999/xlink" xmlns="http://docbook.org/ns/docbook" xml:id="fn_nm_min_notnull">
      <refmeta>
        <refentrytitle>__min_notnull
</refentrytitle>
        <refmiscinfo>number
</refmiscinfo>
      </refmeta>
      <refnamediv>
        <refname>__min_notnull
</refname>
        <refpurpose>Returns minimum value among all its arguments, ignoring NULLs entirely.
</refpurpose>
      </refnamediv>
      <refsynopsisdiv>
        <funcsynopsis xml:id="fsyn___min_notnull">
          <funcprototype xml:id="fproto___min_notnull">
            <funcdef>any 
<function>__min_notnull
</function>

</funcdef>
            <paramdef choice="opt"><parameter>arg1
</parameter>

   any
</paramdef>
            <paramdef choice="opt"><parameter>arg2
</parameter>

   any
</paramdef>
            <paramdef choice="opt">
              <parameter>...
</parameter>
            </paramdef>
            <paramdef choice="opt"><parameter>argN
</parameter>

   any
</paramdef>
          </funcprototype>
        </funcsynopsis>
      </refsynopsisdiv>
      <refsect1 xml:id="desc___min_notnull">
        <title>Description
</title>
        <para>The function returns the minimum value among all values in all its arguments by
  	ignoring NULLs entirely.
</para>
      </refsect1>
      <refsect1 xml:id="params___min_notnull">
        <title>Parameters
</title>
        <refsect2>
          <title>argI
</title>
          <para>Values which can be with type float, integer etc.
</para>
        </refsect2>
      </refsect1>
      <refsect1 xml:id="examples___min_notnull">
        <title>Examples
</title>
        <example xml:id="ex___min_notnull">
          <title> 
  </title>
          <para>
            <emphasis>Example 1
</emphasis>
          </para>
          <screen>
SQL&gt; select __min_notnull (null, 1, 0);
__min_notnull
VARCHAR
_______________________________________________________________________________

0

1 Rows. -- 0 msec.
SQL&gt; select __min (null, 1, 0);
__min
VARCHAR
_______________________________________________________________________________

NULL

1 Rows. -- 0 msec.
</screen>
          <para>
            <emphasis>Example 2</emphasis>
          </para>
          <programlisting>
SQL&gt; SPARQL
INSERT INTO GRAPH &lt;http://mygraph.com&gt;
  {
    &lt;http://mygraph2.com/pricing/#QVal1&gt; &lt;price1&gt;  1 ;                    &lt;price3&gt; 5 .
    &lt;http://mygraph2.com/pricing/#QVal2&gt;                  &lt;price2&gt; 1 ;    &lt;price3&gt; 4 .
    &lt;http://mygraph2.com/pricing/#QVal3&gt; &lt;price1&gt;  6 ;    &lt;price2&gt; 2                 .
  };

Insert into &lt;http://mygraph.com&gt;, 6 (or less) triples -- done
No. of rows in result: 1

SQL&gt; SPARQL SELECT ?s, (bif:__min_notnull (?pr1, ?pr2, ?pr3))
FROM &lt;http://mygraph.com&gt;
WHERE
  {
    {
      SELECT DISTINCT ?s
      WHERE
        {
          ?s ?p ?pr .
          FILTER (?p in (&lt;price1&gt;, &lt;price2&gt;, &lt;price3&gt;))
        }
    }
    OPTIONAL { ?s &lt;price1&gt; ?pr1 }
    OPTIONAL { ?s &lt;price2&gt; ?pr2 }
    OPTIONAL { ?s &lt;price3&gt; ?pr3 }
  };

Query result:
s                                     callret-1
VARCHAR 	                            VARCHAR
_______________________________________________
http://mygraph2.com/pricing/#QVal2	 1
http://mygraph2.com/pricing/#QVal1	 1
http://mygraph2.com/pricing/#QVal3	 2

No. of rows in result: 2
</programlisting>
        </example>
      </refsect1>
      <refsect1 xml:id="seealso___min_notnull">
        <title>See Also
</title>
        <para>
          <link linkend="fn_nm_max">
            <function>__max()
</function>
          </link>
        </para>
        <para>
          <link linkend="fn_nm_min">
            <function>__min()
</function>
          </link>
        </para>
        <para>
          <link linkend="fn_nm_max_notnull">
            <function>__max_notnull()
</function>
          </link>
        </para>
      </refsect1>
    </refentry>
