<html><body><div class="topic-text"><!--Begin of %META:TOPICPARENT{name="VirtTipsAndTricksGuide"}%--><p> </p>
<!--End of %META:TOPICPARENT{name="VirtTipsAndTricksGuide"}%--><h1><a name="How to discover the capabilities of a SPARQL endpoint to enhancing SPARQL-FED usage from Virtuoso instances using LOAD SERVICE ...&#10; DATA"></a>How to discover the capabilities of a SPARQL endpoint to enhancing SPARQL-FED usage from Virtuoso instances using LOAD SERVICE ...
 DATA</h1>
<h2><a name="What?"></a>What?</h2>
 How to discover the capabilities of a SPARQL endpoint en route to enhancing SPARQL-FED usage from Virtuoso instances using LOAD SERVICE ...
 DATA.<h2><a name="Why?"></a>Why?</h2>
<p>There are features supported in Virtuoso SPARQL that aren&#39;t supported by other SPARQL engines.
 There are also a lot of Virtuoso instances behind bubbles in the LOD cloud.
 Net effect, a Virtuoso instance operator is faced with varied behavior when attempting to use SPARQL-FED functionality.</p>
<h2><a name="How?"></a>How?</h2>
<p>Run this command to load metadata (or lack thereof) from an external SPARQL endpoint:</p>
<br><pre>SPARQL LOAD SERVICE &lt;sparql-endpoint-iri&gt; DATA 
</pre><p> </p>
<h3><a name="Example"></a>Example</h3>
<ol><li>Load <a href="http://lod.openlinksw.com" class="absuri">LOD</a> SPARQL Endpoint data: <br><pre><br>SPARQL LOAD SERVICE &lt;http://lod.openlinksw.com/sparql&gt; DATA 

Query result:

ANY
 Load service &lt;http://lod.openlinksw.com/sparql&gt; data -- done.  
 Trying to query &lt;http://lod.openlinksw.com/sparql&gt; as SPARQL web service endpoint, POST mode...
</pre><br></li>
<li>Check the loaded data: <br><pre><br>SPARQL 
SELECT * 
  FROM virtrdf: 
 WHERE 
     {
       &lt;http://lod.openlinksw.com/sparql&gt; ?p ?o
     }
 LIMIT 10


Query result:
p                                                                o 
ANY                                                              ANY 	
http://www.openlinksw.com/schemas/virtrdf#isEndpointOfService	 http://lod.openlinksw.com/sparql-sd
http://www.openlinksw.com/schemas/virtrdf#dialect                000037ff
</pre><br></li>
</ol><h2><a name="Additional Usage Benefits"></a>Additional Usage Benefits</h2>
<p> Suppose one queries a remote endpoint and get sort of <i>&quot;Unsupported ..
 &quot;</i> kind of errors -- the proper solution is to run <code>SPARQL LOAD SERVICE DATA</code>.
 If however the error persists, one should rephrase the query as the remote can&#39;t handle the query in its current form.</p>
<p> </p>
<h2><a name="Related"></a>Related</h2>
<ul><li><a href="http://vos.openlinksw.com:80/dataspace/owiki/wiki/VOS/VirtTipsAndTricksGuide" class="wikiword">Virtuoso Tips and Tricks Collection</a> </li>
<li><a href="http://vos.openlinksw.com:80/dataspace/owiki/wiki/VOS/VirtTipsAndTricksDiscoverSPARQFedCapabilitiesSPARQL" class="wikiword">Adding SPARQL Endpoint Capabilities Interrogation to Virtuoso SPARQL-FED functionality</a></li>
</ul><p> </p>
</div></body></html>